Feature: TC009
  Перевірка обов'язковості та формату поля 'Password'

  Scenario: Перевірка обов'язковості та формату поля 'Password'
    Given Перейти на сторінку реєстрації.
    When Залишити поле 'Password' порожнім.
    Then Подання не дозволяється. З'являється повідомлення про помилку, що поле 'Password' є обов'язковим.

    When Ввести 'password' менше '8' символів.
    Then Подання не дозволяється. З'являється повідомлення про помилку, що довжина 'password' має бути не менше '8' символів.

    When Ввести 'password' без великої літери та спецсимволу.
    Then Подання не дозволяється. З'являється повідомлення про помилку, що 'password' має містити хоча б одну велику літеру та один спецсимвол.

    When Ввести 'ValidP1'.
    Then Якщо інші поля валідні, подання успішне. Повідомлення про помилку, пов'язане з полем 'Password', не з'являється.