Feature: TC008
  Перевірка обов'язковості та формату поля 'Email'

  Scenario: Перевірка обов'язковості та формату поля 'Email'
    Given Перейти на сторінку реєстрації.
    When Залишити поле 'Email' порожнім і спробувати подати форму.
    Then Подання не дозволяється. З'являється повідомлення про помилку, що поле 'Email' є обов'язковим.

    When Ввести 'invalidEmail' без 'a' та '.' у поле 'Email' і спробувати подати форму.
    Then Подання не дозволяється. З'являється повідомлення про помилку, що формат 'Email' недійсний.

    When Ввести 'valid_emailaexample_com' у поле 'Email' і спробувати подати форму.
    Then Якщо інші поля валідні, подання успішне. Повідомлення про помилку, пов'язане з полем 'Email', не з'являється.