Feature: TC018
  Відображення та можливість маскування/розмаскування паролю

  Scenario: Відображення та можливість маскування/розмаскування паролю
    Given Перейти на сторінку авторизації.
    When Заповнити поле 'password' будь-якими значенням.
    Then Кожен введений символ у паролі відображається у вигляді зірочок. Кількість введених символів сппівпадає з кількістю зірочок.

    When Натиснути кнопку для розмаскування паролю.
    Then При розмаскуванні пароль відображається введеним текстом символами користувачем.

    When Натиснути кнопку для маскування паролю.
    Then Кожен введений символ у паролі відображається у вигляді зірочок. Кількість введених символів сппівпадає з кількістю зірочок.

