Feature: TC027
  Перевірка одноразовості посилання після повторного запиту на відновлення паролю

  Scenario: Перевірка одноразовості посилання після повторного запиту на відновлення паролю
    Given Перейти на сторінку авторизації.
    Then Клацнути на посилання 'forgot password'.
    When Ввести у поле пошту та натинсути клавішу 'Send Reset Link'.
    Then Перейти за посиланням яке буде відправлено на пошту.
    Then Запам'ятати посилання яке було відправлено на пошту.
    Given Перейти на сторінку авторизації.
    Then Клацнути на посилання 'forgot password'.
    When Ввести у поле пошту та натинсути клавішу 'Send Reset Link'.
    Then Перейти за посиланням яке буде відправлено на пошту.
    Then Перейти за запам'ятованим посиланням яке було відправлено на пошту.
    When Ввести валідні дані нового паролю новий пароль '2' та натиснути кнопку 'Change password'.
    Then Переадресація на сторінку авторизації. Увійти з новим паролем новий пароль '2'.
    Then Отримати помилку про невдалий вхід.
