Feature: TC026
  Перевірка одноразовості посилання після зміни пароля

  Scenario: Перевірка одноразовості посилання після зміни пароля
    Given Перейти на сторінку авторизації.
    Then Клацнути на посилання 'forgot password'.
    When Ввести у поле пошту та натинсути клавішу 'Send Reset Link'.
    Then Перейти за посиланням яке буде відправлено на пошту.
    When Ввести валідні дані нового паролю та атиснути кнопку 'Change password'.
    Then Переадресація на сторінку авторизації. Увійти з новим паролем.
    Then Перевірити вхід. Вийти з акаунту.
    Then Перейти за посиланням яке буде відправлено на пошту.
    When Ввести валідні дані нового паролю новий пароль та натиснути кнопку 'Change password'.
    Then Переадресація на сторінку авторизації. Увійти з новим паролем новий пароль.
    Then Отримати помилку про невдалий вхід.
