Feature: TC023
  Відновлення паролю посилання 'Forgot Password?'

  Scenario: Відновлення паролю посилання 'Forgot Password?'
    Given Перейти на сторінку авторизації.
    Then Клацнути на посилання 'forgot password'.
    When Ввести у поле пошту та натинсути клавішу 'Send Reset Link'.
    Then Перейти за посиланням яке буде відправлено на пошту.
    When Ввести валідні дані нового паролю та атиснути кнопку 'Change password'.
    Then Переадресація на сторінку авторизації. Увійти з новим паролем.
    Then Перевірити вхід. Вийти з акаунту.
