Feature: TC038
  Перевірка відображення переліку баз даних та їхніх параметрів, кнопки основних дій із ними, параметри з'єднання на сторінці користувача

  Scenario: Перевірка відображення переліку баз даних та їхніх параметрів, кнопки основних дій із ними, параметри з'єднання на сторінці користувача
    Given Перейти на сторінку авторизації.
    When Увійдіть в систему, використовуючи свій обліковий запис, на якому встановлено роль 'Basic'.
    Then Переконайтеся, що на сторінці відображається перелік існуючих баз даних користувача.
    When Для кожної бази даних відображається назва, параметри з'єднання та основні дії.
    Then Виконайте дію Відкрити для однієї з баз даних.
    When Поверніться на головну сторінку користувача.
    Then Переконайтеся, що на сторінці відображається перелік існуючих баз даних користувача.
    Given Вийдіть із системи.
