Feature: TC035
  Перевірка повідомлення про необхідність пройти підтвердження пошти користувачу, що не пройшли перевірку e-mail

  Scenario: Перевірка повідомлення про необхідність пройти підтвердження пошти користувачу, що не пройшли перевірку e-mail
    Given Перейти на сторінку реєстрації.
    When Успішно заповнити та подати форму реєстрації.
    Then Переконайтеся, що після реєстрації вам присвоєна роль 'Not-checked user'.
    Then Користувач перенаправляється на домашню сторінку протягом '5' секунд.
    Given Перейти на сторінку авторизації.
    When Увійдіть в систему, використовуючи свій обліковий запис.
    Then Упевніться, що ви можете ввійти в систему без проблем.
    Then Перевірте сторінку свого профілю користувача, щоб побачити, чи відображається посилання для перевірки 'e-mail'.
    Given Вийдіть із системи.
