Feature: TC036
  Відображення посилання на профіль користувача для користувачів з ролями Basic та Pro

  Scenario: Відображення посилання на профіль користувача для користувачів з ролями Basic та Pro
    Given Перейти на сторінку авторизації.
    When Увійдіть в систему, використовуючи свій обліковий запис, на якому встановлено роль 'Basic'.
    Then Переконайтеся, що вам відображається посилання на ваш профіль користувача.
    Given Вийдіть із системи.
    When Увійдіть в систему, використовуючи обліковий запис, на якому встановлено роль 'Pro'.
    Then Переконайтеся, що вам відображається посилання на ваш профіль користувача.
    Given Вийдіть із системи.