Feature: TC043
  Після спроби видалити БД з'являється спливаюче вікно з підтвердженням видалення

  Scenario: Після спроби видалити БД з'являється спливаюче вікно з підтвердженням видалення
    Given Перейти на сторінку авторизації.
    When Увійдіть в систему, використовуючи свій обліковий запис, на якому встановлено роль 'Basic'.
    When Створіть нову базу даних.
    When Поверніться на головну сторінку користувача.
    Then Видаліть базу даних та перевірте чи вона видалилася.
    Given Вийдіть із системи.
    Then Підтвердіть видалення бази даних у спливаючому вікні.
