Feature: TC041
  Перевірка наявності параметрів підключення та доступних баз даних  на сторінці користувача

  Scenario: Перевірка наявності параметрів підключення та доступних баз даних  на сторінці користувача
    Given Перейти на сторінку авторизації.
    When Увійдіть в систему, використовуючи свій обліковий запис, на якому встановлено роль 'Basic'.
    Then Переконайтеся, що на сторінці відображається перелік існуючих баз даних користувача.
    When Для кожної бази даних відображається назва, параметри з'єднання та основні дії.
    Given Вийдіть із системи.
