Feature: TC048
  Перевірка можливості регенерації ключів API за допомогою кнопки "Re-generate".

  Scenario: Перевірка можливості регенерації ключів API за допомогою кнопки "Re-generate".
    Given Перейти на сторінку авторизації.
    When Увійдіть в систему, використовуючи свій обліковий запис, на якому встановлено роль 'Basic'.
    Then Перейти на сторінку профіля.
    When Натиснути кнопку 'Re-generate' для ключа 'API'.
    Then Перевіити чи ключ 'API' оновився.
    Given Вийдіть із системи.
