Feature: TC053
  Перевірка можливості переходу між ролями та користувачами

  Scenario: Перевірка можливості переходу між ролями та користувачами
    Given Перейти на сторінку авторизації.
    When Увійдіть в систему, використовуючи свій обліковий запис, на якому встановлено роль 'Basic'.
    Then Переконайтеся, що на сторінці відображається статус обмежень для 'Basic' відсоток вільного місця у сховищі та кількість баз даних, які можна створити.
    Given Вийдіть із системи.
    When Увійдіть в систему, використовуючи обліковий запис, на якому встановлено роль 'Pro'.
    Then Переконайтеся, що на сторінці відображається статус обмежень для 'Pro' відсоток вільного місця у сховищі та кількість баз даних, які можна створити.
    Given Вийдіть із системи.
