Feature: TC050
  Перевірка відображення імені та пароля користувача для доступу до його персональних БД

  Scenario: Перевірка відображення імені та пароля користувача для доступу до його персональних БД
    Given Перейти на сторінку авторизації.
    When Увійдіть в систему, використовуючи свій обліковий запис, на якому встановлено роль 'Basic'.
    Then Перейти на сторінку профіля.
    When Впевнетись що нявний блок відображення імені та пароля користувача для доступу до його персональних БД.
    Given Вийдіть із системи.
